#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
module.s3origin["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/a8bc71bc-b05a-48c3-92a5-5e5fad4bb4ed]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=405747234]
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=3524774637]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=2024-01-19 17:21:10.106 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_distribution.davidbornitz will be created
  + resource "aws_cloudfront_distribution" "davidbornitz" {
      + aliases                         = [
          + "davidbornitz.dev",
          + "resume.davidbornitz.dev",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "resume.davidbornitz.dev"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "davidbornitz.dev.s3.us-east-2.amazonaws.com"
          + origin_access_control_id = "E2IARHGO3S8MHZ"
          + origin_id                = "davidbornitz.dev"
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "resume.davidbornitz.dev.s3.us-east-2.amazonaws.com"
          + origin_access_control_id = "E2IARHGO3S8MHZ"
          + origin_id                = "resume.davidbornitz.dev"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:085879623427:certificate/a8bc71bc-b05a-48c3-92a5-5e5fad4bb4ed"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.record["davidbornitz.dev"] will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "davidbornitz.dev"
      + type            = "A"
      + zone_id         = "Z04601461HBLV7APEL0VR"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.record["resume.davidbornitz.dev"] will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "resume.davidbornitz.dev"
      + type            = "A"
      + zone_id         = "Z04601461HBLV7APEL0VR"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::davidbornitz.dev/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.bucket-access["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = "davidbornitz.dev"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::resume.davidbornitz.dev/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.bucket-access["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = "resume.davidbornitz.dev"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*